#===============================================================================
# ■ 修正卷动地图时，事件位置偏移1像素的bug
# by ：VIPArcher [email: VIPArcher@sina.com]
#  -- Project1 论坛：https://rpg.blue/ 使用或转载请保留以上信息。
#==============================================================================
class Game_Map
  def display_x;(@display_x * 32).floor.to_f / 32 end # 显示 X 坐标
  def display_y;(@display_y * 32).floor.to_f / 32 end # 显示 Y 坐标
  #--------------------------------------------------------------------------
  # ● 计算显示坐标的剩余 X 坐标
  #--------------------------------------------------------------------------
  alias fix_adjust_x adjust_x
  def adjust_x(x) @display_x = display_x; fix_adjust_x(x) end
  #--------------------------------------------------------------------------
  # ● 计算显示坐标的剩余 Y 坐标
  #--------------------------------------------------------------------------
  alias fix_adjust_y adjust_y
  def adjust_y(y) @display_y = display_y; fix_adjust_y(y) end
end
