#===============================================================================
#  判断当前位置 By：VIPArcher
#===============================================================================
#  -- 本脚本来自 http://rm.66rpg.com 使用或转载请保留以上信息。
#  说明：偷懒用，纯事件完全可以轻松做出相同效果，该脚本只是为了更加偷懒
#    用法是:分歧条件-脚本-
#    player_map_pos?(m, x, y)  #判断玩家当前位置是否为(m, x, y) m 为地图ID
#    player_pos?(x ,y)         #判断玩家当前位置是否为(x,y)
#    event_pos?(x, y)          #判断本事件当前坐标位置是否为(x,y)
#  另外：get_character(param)  是个好东西
#===============================================================================
$VIPArcherScript ||= {};$VIPArcherScript[:location] = 20141203
#--------------------------------------------------------------------------------
class Game_Interpreter
  #--------------------------------------------------------------------------
  # ● 判断玩家当前坐标位置是否为(m, x, y)
  #--------------------------------------------------------------------------
  def player_map_pos?(m, x, y)
    $game_map.map_id == m && player_pos?(x, y)
  end
  #--------------------------------------------------------------------------
  # ● 判断玩家当前坐标位置是否为(x,y)
  #--------------------------------------------------------------------------
  def player_pos?(x, y)
    $game_player.pos?(x, y)
  end
  #--------------------------------------------------------------------------
  # ● 判断本事件当前坐标位置是否为(x,y)
  #--------------------------------------------------------------------------
  def event_pos?(x, y)
    $game_map.events[@event_id].pos?(x, y)
  end
end