#==============================================================================
# ■ 控制符颜色扩展
# By ：VIPArcher
#  -- 本脚本来自 http://rm.66rpg.com 使用或转载请保留以上信息。
#==============================================================================
$VIPArcherScript ||= {};$VIPArcherScript[:textcolor] = 20141012
module VIPArcher;end
module VIPArcher
  Text_Color = { #<-这行不能删除
  
   #颜色编号  #颜色（R,G,B[,A]）
    32 => Color.new(0, 0, 255,255),
    33 => Color.new(0, 255, 0),
    34 => Color.new(255, 0, 0),
    35 => Color.new(233, 233, 233)
    #在这里继续追加。
    
    } #<-这行不能删除
end
#--------------------------------------------------------------------------------
class Window_Base < Window
  #--------------------------------------------------------------------------
  # ● 获取文字颜色
  #     n : 文字颜色编号（0..31）
  #--------------------------------------------------------------------------
  alias vip_ex_text_color text_color
  def text_color(n)
    return VIPArcher::Text_Color[n] if n > 31
    vip_ex_text_color(n)
  end
end