#==============================================================================
# ■ 限时显示选项
# By ：VIPArcher
#  -- 本脚本来自 http://rm.66rpg.com 使用或转载请保留以上信息。
#==============================================================================
# 说明：
#   在开始选择前开启计时器，如果计时器归0时自动调用“取消”的方法。要保证取消有效。
#==============================================================================
$VIPArcherScript ||= {};$VIPArcherScript[:time_choiceList] = 20141027
#--------------------------------------------------------------------------------
class Window_ChoiceList < Window_Command
  #--------------------------------------------------------------------------
  # ● 调用“取消”的处理方法
  #--------------------------------------------------------------------------
  alias timer_call_cancel_handler call_cancel_handler
  def call_cancel_handler
    timer_call_cancel_handler ; deactivate ; $game_timer.stop
  end
  #--------------------------------------------------------------------------
  # ● 更新画面
  #--------------------------------------------------------------------------
  def update
    super
    call_cancel_handler if cancel_enabled? &&
    $game_timer.sec == 0 && $game_timer.working?
  end
end